<template>
  <div>
    <ul>
      <li class="fe_card">
        <h3>XX需求改版2.0</h3>
        <p class="fe_cardDesc">简介:主要是为了修改什么，增加什么，实现什么功能。。。。。。。。</p>
        <section>
          活动顺带撒谎的家伙撒娇的好时机爱好的萨达哈就撒换掉即可沙姜粉客户端减少开发环境都是翻江倒海十分简单活动顺带撒谎的家伙撒娇的好时机爱好的萨达哈就撒换掉即可沙姜粉客户端减少开发环境都是翻江倒海十分简单活动顺带撒谎的家伙撒娇的好时机爱好的萨达哈就撒换掉即可沙姜粉客户端减少开发环境都是翻江倒海十分简单活动顺带撒谎的家伙撒娇的好时机爱好的萨达哈就撒换掉即可沙姜粉客户端减少开发环境都是翻江倒海十分简单活动顺带撒谎的家伙撒娇的好时机爱好的萨达哈就撒换掉即可沙姜粉客户端减少开发环境都是翻江倒海十分简单活动顺带撒谎的家伙撒娇的好时机爱好的萨达哈就撒换掉即可沙姜粉客户端减少开发环境都是翻江倒海十分简单活动顺带撒谎的家伙撒娇的好时机爱好的萨达哈就撒换掉即可沙姜粉客户端减少开发环境都是翻江倒海十分简单活动顺带撒谎的家伙撒娇的好时机爱好的萨达哈就撒换掉即可沙姜粉客户端减少开发环境都是翻江倒海十分简单活动顺带撒谎的家伙撒娇的好时机爱好的萨达哈就撒换掉即可沙姜粉客户端减少开发环境都是翻江倒海十分简单活动顺带撒谎的家伙撒娇的好时机爱好的萨达哈就撒换掉即可沙姜粉客户端减少开发环境都是翻江倒海十分简单活动顺带撒谎的家伙撒娇的好时机爱好的萨达哈就撒换掉即可沙姜粉客户端减少开发环境都是翻江倒海十分简单
        </section>
        <p class="fe_cardTime">2019-09-12 10:00:00 / 需求方：运营 / 产品：某个 / 前端开发：某个 / 后端开发：某个 状态：已上线</p>
      </li>
      <li class="fe_card">
        <h3>XX需求改版2.0</h3>
        <p class="fe_cardDesc">简介:主要是为了修改什么，增加什么，实现什么功能。。。。。。。。</p>
        <section>
          活动顺带撒谎的家伙撒娇的好时机爱好的萨达哈就撒换掉即可沙姜粉客户端减少开发环境都是翻江倒海十分简单活动顺带撒谎的家伙撒娇的好时机爱好的萨达哈就撒换掉即可沙姜粉客户端减少开发环境都是翻江倒海十分简单活动顺带撒谎的家伙撒娇的好时机爱好的萨达哈就撒换掉即可沙姜粉客户端减少开发环境都是翻江倒海十分简单活动顺带撒谎的家伙撒娇的好时机爱好的萨达哈就撒换掉即可沙姜粉客户端减少开发环境都是翻江倒海十分简单活动顺带撒谎的家伙撒娇的好时机爱好的萨达哈就撒换掉即可沙姜粉客户端减少开发环境都是翻江倒海十分简单活动顺带撒谎的家伙撒娇的好时机爱好的萨达哈就撒换掉即可沙姜粉客户端减少开发环境都是翻江倒海十分简单活动顺带撒谎的家伙撒娇的好时机爱好的萨达哈就撒换掉即可沙姜粉客户端减少开发环境都是翻江倒海十分简单活动顺带撒谎的家伙撒娇的好时机爱好的萨达哈就撒换掉即可沙姜粉客户端减少开发环境都是翻江倒海十分简单活动顺带撒谎的家伙撒娇的好时机爱好的萨达哈就撒换掉即可沙姜粉客户端减少开发环境都是翻江倒海十分简单活动顺带撒谎的家伙撒娇的好时机爱好的萨达哈就撒换掉即可沙姜粉客户端减少开发环境都是翻江倒海十分简单活动顺带撒谎的家伙撒娇的好时机爱好的萨达哈就撒换掉即可沙姜粉客户端减少开发环境都是翻江倒海十分简单
        </section>
        <p class="fe_cardTime">2019-09-12 10:00:00 / 需求方：运营 / 产品：某个 / 前端开发：某个 / 后端开发：某个 状态：已上线</p>
      </li>
    </ul>
  </div>
</template>

<script>

  export default {
    name:'',
    props:[''],
    data () {
      return {
      }
    },
    components: {},
    computed: {},
    beforeMount() {},
    mounted() {},
    methods: {},
    watch: {}
  }

</script>
<style lang='scss' scoped>
.fe_card {
  list-style: none;
  width: 90%;
  height: 216px;
  box-shadow: rgba(0,0,0,.3) 0 0 10px;
  border-radius: 10px;
  text-align: left;
  padding: 10px;
  line-height: 30px;
  margin-bottom: 20px;
  h3, p{
    white-space: nowrap;
    overflow: hidden;
  }
  &Desc {
    border-bottom: 1px solid #ddd;
    margin-bottom: 10px;
  }
  &Time {
    color: #aaa;
    font-size: 12px;
  }
  section{ 
    overflow: hidden;
    text-overflow: ellipsis;
    display: -webkit-box;
    -webkit-line-clamp: 4;
    -webkit-box-orient: vertical;
    color: #666;
  }
}
</style>